Repository: MatthiasPeltzer/mpc-rss
Catalog: Resources/Private/Language/*.locallang_db.xlf
Languages: de

# plugin.description
source: Display RSS feeds with category filtering and pagination
de: RSS-Feeds mit Kategoriefilterung und Seitenumbruch anzeigen

# tx_mpcrss_domain_model_feed.title
source: Feed Title
de: Feed-Titel

# tx_mpcrss_domain_model_feed.feed_url.description
source: Enter the complete RSS/Atom feed URL (e.g., https://example.com/feed.rss)
de: Geben Sie die vollständige RSS/Atom-Feed-URL ein (z.B. https://example.com/feed.rss)

# tx_mpcrss_domain_model_feed.source_name
source: Source Name (Display Label)
de: Quellenname (Anzeigename)

# tx_mpcrss_domain_model_feed.source_name.description
source: Optional: Custom label for this source (e.g., "BBC News", "TechCrunch", "My Blog"). Leave empty to auto-detect from URL.
de: Optional: Benutzerdefinierter Name für diese Quelle (z.B. "BBC News", "TechCrunch", "Mein Blog"). Leer lassen für automatische Erkennung aus der URL.

# tx_mpcrss_domain_model_feed.description
source: Description
de: Beschreibung

# tx_mpcrss_domain_model_feed.description.description
source: Optional internal notes about this feed
de: Optional interne Notizen zu diesem Feed

# tt_content.tx_mpcrss_feeds.description
source: Add RSS/Atom feed URLs. Click "Create new" to add a feed.
de: RSS/Atom-Feed-URLs hinzufügen. Klicken Sie auf "Neu erstellen", um einen Feed hinzuzufügen.

# tt_content.tx_mpcrss_default_category
source: Default Category
de: Standard-Kategorie

# tt_content.tx_mpcrss_default_category.description
source: Which category to display by default (e.g., Politics, Economy)
de: Welche Kategorie standardmäßig angezeigt werden soll (z.B. Politik, Wirtschaft)

# tt_content.tx_mpcrss_grouping_mode
source: Grouping Mode
de: Gruppierungsmodus

# tt_content.tx_mpcrss_grouping_mode.description
source: Choose how to organize feed items: by category (topic), by source (outlet), by date, or as unified timeline
de: Wählen Sie, wie Feed-Einträge organisiert werden: nach Kategorie (Thema), nach Quelle (Medium), nach Datum oder als einheitliche Timeline

# tt_content.tx_mpcrss_grouping_mode.category
source: Category (Group by topic/subject)
de: Kategorie (Gruppierung nach Thema)

# tt_content.tx_mpcrss_grouping_mode.source
source: Source (Group by news outlet/feed)
de: Quelle (Gruppierung nach Medium/Feed)

# tt_content.tx_mpcrss_grouping_mode.date
source: Date (Group by time period)
de: Datum (Gruppierung nach Zeitraum)

# tt_content.tx_mpcrss_grouping_mode.none
source: None (Unified timeline, no grouping)
de: Keine (Einheitliche Timeline, keine Gruppierung)

# tt_content.tx_mpcrss_include_categories
source: Include Categories
de: Kategorien einbeziehen

# tt_content.tx_mpcrss_include_categories.description
source: Comma-separated list of categories to show. Leave empty to show all categories.
de: Kommagetrennte Liste von Kategorien, die angezeigt werden sollen. Leer lassen, um alle Kategorien anzuzeigen.

# tt_content.tx_mpcrss_exclude_categories
source: Exclude Categories
de: Kategorien ausschließen

# tt_content.tx_mpcrss_exclude_categories.description
source: Comma-separated list of categories to hide
de: Kommagetrennte Liste von Kategorien, die ausgeblendet werden sollen

# tt_content.tx_mpcrss_max_items
source: Max Items per Category
de: Max. Einträge pro Kategorie

# tt_content.tx_mpcrss_max_items.description
source: Maximum number of feed items to display per category
de: Maximale Anzahl von Feed-Einträgen, die pro Kategorie angezeigt werden sollen

# tt_content.tx_mpcrss_cache_lifetime
source: Cache Lifetime (seconds)
de: Cache-Lebensdauer (Sekunden)

# tt_content.tx_mpcrss_cache_lifetime.description
source: How long feed data should be cached (default: 1800 seconds = 30 minutes)
de: Wie lange Feed-Daten zwischengespeichert werden sollen (Standard: 1800 Sekunden = 30 Minuten)

# tt_content.tx_mpcrss_show_filter
source: Show Category Filter Navigation
de: Kategorie-Filter-Navigation anzeigen

# tt_content.tx_mpcrss_show_filter.description
source: Display category filter buttons at the top
de: Kategorie-Filter-Schaltflächen oben anzeigen

# tt_content.tx_mpcrss_paginate
source: Enable Pagination
de: Seitenumbruch aktivieren

# tt_content.tx_mpcrss_paginate.description
source: Enable paginated view for single category
de: Seitenumbruch für einzelne Kategorie aktivieren

# tt_content.tx_mpcrss_items_per_page
source: Items per Page
de: Einträge pro Seite

# tt_content.tx_mpcrss_items_per_page.description
source: Number of items per page when pagination is enabled
de: Anzahl der Einträge pro Seite bei aktiviertem Seitenumbruch
