Repository: MatthiasPeltzer/mpc-rss
Catalog: Resources/Private/Language/*.locallang_sitesettings.xlf
Languages: de

# mpcRss.description
source: Configure default settings for RSS feed display
de: Standardeinstellungen für die RSS-Feed-Anzeige konfigurieren

# mpcRssView.label
source: MPC RSS View Paths
de: MPC RSS Ansichtspfade

# mpcRssView.description
source: Configure template, partial and layout paths for custom styling
de: Template-, Partial- und Layout-Pfade für individuelles Styling konfigurieren

# plugin.tx_mpcrss.view.templateRootPath.label
source: Template Root Path
de: Template-Stammpfad

# plugin.tx_mpcrss.view.templateRootPath.description
source: Path to custom templates (e.g., EXT:your_ext/Resources/Private/Templates/)
de: Pfad zu benutzerdefinierten Templates (z.B. EXT:your_ext/Resources/Private/Templates/)

# plugin.tx_mpcrss.view.partialRootPath.label
source: Partial Root Path
de: Partial-Stammpfad

# plugin.tx_mpcrss.view.partialRootPath.description
source: Path to custom partials (e.g., EXT:your_ext/Resources/Private/Partials/)
de: Pfad zu benutzerdefinierten Partials (z.B. EXT:your_ext/Resources/Private/Partials/)

# plugin.tx_mpcrss.view.layoutRootPath.label
source: Layout Root Path
de: Layout-Stammpfad

# plugin.tx_mpcrss.view.layoutRootPath.description
source: Path to custom layouts (e.g., EXT:your_ext/Resources/Private/Layouts/)
de: Pfad zu benutzerdefinierten Layouts (z.B. EXT:your_ext/Resources/Private/Layouts/)

# plugin.tx_mpcrss.settings.maxItems.label
source: Max Items per Feed
de: Max. Einträge pro Feed

# plugin.tx_mpcrss.settings.maxItems.description
source: Maximum number of items to display from each feed
de: Maximale Anzahl der anzuzeigenden Einträge pro Feed

# plugin.tx_mpcrss.settings.cacheLifetime.label
source: Cache Lifetime (seconds)
de: Cache-Lebensdauer (Sekunden)

# plugin.tx_mpcrss.settings.cacheLifetime.description
source: How long to cache feed data in seconds (default: 1800 = 30 minutes)
de: Wie lange Feed-Daten in Sekunden gecacht werden sollen (Standard: 1800 = 30 Minuten)

# plugin.tx_mpcrss.settings.includeCategories.label
source: Include Categories
de: Kategorien einschließen

# plugin.tx_mpcrss.settings.includeCategories.description
source: Comma-separated list of categories to include (leave empty for all)
de: Kommagetrennte Liste der einzuschließenden Kategorien (leer lassen für alle)

# plugin.tx_mpcrss.settings.excludeCategories.label
source: Exclude Categories
de: Kategorien ausschließen

# plugin.tx_mpcrss.settings.excludeCategories.description
source: Comma-separated list of categories to exclude
de: Kommagetrennte Liste der auszuschließenden Kategorien

# plugin.tx_mpcrss.settings.showCategoryFilter.label
source: Show Category Filter
de: Kategoriefilter anzeigen

# plugin.tx_mpcrss.settings.showCategoryFilter.description
source: Display category navigation in frontend
de: Kategorienavigation im Frontend anzeigen

# plugin.tx_mpcrss.settings.paginate.label
source: Enable Pagination
de: Paginierung aktivieren

# plugin.tx_mpcrss.settings.paginate.description
source: Paginate items within a category
de: Einträge innerhalb einer Kategorie paginieren

# plugin.tx_mpcrss.settings.itemsPerPage.label
source: Items per Page
de: Einträge pro Seite

# plugin.tx_mpcrss.settings.itemsPerPage.description
source: Number of items per page when pagination is enabled
de: Anzahl der Einträge pro Seite bei aktivierter Paginierung

# plugin.tx_mpcrss.settings.defaultCategory.label
source: Default Category
de: Standardkategorie

# plugin.tx_mpcrss.settings.defaultCategory.description
source: Which category to show by default (e.g., Politik, News, etc.)
de: Welche Kategorie standardmäßig angezeigt werden soll (z.B. Politik, News, etc.)

# plugin.tx_mpcrss.settings.groupingMode.label
source: Grouping Mode
de: Gruppierungsmodus

# plugin.tx_mpcrss.settings.groupingMode.description
source: How to organize feed items: category, source, date, or none (unified timeline)
de: Wie Feed-Einträge organisiert werden: category, source, date oder none (einheitliche Timeline)
